// Подглава 1.2 Основные концепции

// JavaScript, будучи мультипарадигменным языком программирования, включает в себя ряд основных концепций,
// которые определяют его уникальность и широкое применение:

// 1. Динамическая типизация: JavaScript обладает динамической типизацией, что позволяет переменным
// автоматически адаптироваться к типам данных во время выполнения программы.

// 2. Слабая типизация: В отличие от некоторых других языков программирования, JavaScript имеет слабую типизацию,
// что означает, что типы данных могут быть неявно преобразованы в другие типы во время выполнения операций.

// 3. Автоматическое управление памятью: JavaScript осуществляет автоматическое управление памятью,
// что означает, что разработчику не нужно явно освобождать память после использования переменных.

// 4. Прототипное программирование: Одним из ключевых концептов JavaScript является прототипное программирование,
// которое позволяет создавать объекты на основе других объектов, что упрощает механизм наследования.

// 5. Функции как объекты первого класса: JavaScript рассматривает функции как объекты первого класса,
// что означает, что функции могут быть переданы в качестве аргументов, присвоены переменным и возвращены
// из других функций.
