// Глава 1: Введение в функции JavaScript

// Подглава 1.1: Основные понятия

// Что такое функция?
/*
Функция в JavaScript представляет собой блок кода, который может быть вызван или выполнен для выполнения определенной задачи. 
Функции в JavaScript могут принимать аргументы (входные данные), обрабатывать их и возвращать результат (выходные данные).
*/

// Зачем нужны функции в JavaScript?
/*
Функции в JavaScript играют важную роль в организации кода и повторном использовании. 
Они позволяют структурировать программу на более мелкие и логические блоки, что упрощает понимание и поддержку кода. 
Также функции способствуют повторному использованию кода, что уменьшает его дублирование и повышает эффективность разработки.
*/

// Преимущества использования функций
/*
1. Модульность: Функции позволяют разбивать код на небольшие, самодостаточные модули, что облегчает его понимание и поддержку.
2. Повторное использование: Однажды написанную функцию можно вызывать из различных частей программы, что позволяет избежать дублирования кода.
3. Улучшенная поддерживаемость: Использование функций делает код более организованным и понятным, что упрощает его поддержку и расширение.
4. Уменьшение ошибок: Функции помогают изолировать и тестировать отдельные части кода, что уменьшает вероятность возникновения ошибок и облегчает их отладку.
*/
