// JavaScript (англ. /ˈdʒɑːvəskrɪpt/; аббр. JS) — мультипарадигменный язык программирования. 
// Поддерживает объектно-ориентированный, императивный и функциональный стили. 
// Является реализацией спецификации ECMAScript (стандарт ECMA-262[2]).

// JavaScript обычно используется как встраиваемый язык для программного доступа к объектам приложений. 
// Наиболее широкое применение находит в браузерах как язык сценариев для придания интерактивности веб-страницам[8].

// Основные архитектурные черты: динамическая типизация, слабая типизация, автоматическое управление памятью, 
// прототипное программирование, функции как объекты первого класса.

// На JavaScript оказали влияние многие языки, при разработке была цель сделать язык похожим на Java. 
// Языком JavaScript не владеет какая-либо организация или компания, что отличает его от ряда языков 
// программирования, используемых в веб-разработке[~ 1][9].

// Название «JavaScript» является зарегистрированным товарным знаком корпорации Oracle в США[10].

// В 1992 году компания Nombas (впоследствии приобретённая Openwave[en]) начала разработку встраиваемого 
// скриптового языка Cmm (Си-минус-минус), который, по замыслу разработчиков, должен был стать достаточно 
// мощным, чтобы заменить макросы, сохраняя при этом схожесть с Си, чтобы разработчикам не составляло труда 
// изучить его[11]. Главным отличием от Си была работа с памятью. В новом языке всё управление памятью 
// осуществлялось автоматически: не было необходимости создавать буфера, объявлять переменные, 
// осуществлять преобразование типов. В остальном языки сильно походили друг на друга: в частности, 
// Cmm поддерживал стандартные функции и операторы Си[12]. Cmm был переименован в ScriptEase, поскольку 
// исходное название звучало слишком негативно, а упоминание в нём Си «отпугивало» людей[11][13]. 
// На основе этого языка был создан проприетарный продукт CEnvi. В конце ноября 1995 года Nombas 
// разработала версию CEnvi, внедряемую в веб-страницы. Страницы, которые можно было изменять с помощью 
// скриптового языка, получили название Espresso Pages — они демонстрировали использование скриптового 
// языка для создания игры, проверки пользовательского ввода в формы и создания анимации. Espresso Pages 
// позиционировались как демоверсия, призванная помочь представить, что случится, если в браузер будет 
// внедрён язык Cmm. Работали они только в 16-битовом Netscape Navigator под управлением Windows[14].

// Самая первая реализация JavaScript была создана Бренданом Эйхом (англ. Brendan Eich) в компании Netscape, 
// и с тех пор обновляется, чтобы соответствовать ECMA-262 Edition 5 и более поздним версиям. Этот движок 
// называется SpiderMonkey и реализован на языке C/C++. Движок Rhino создан Норрисом Бойдом (англ. Norris Boyd) 
// и реализован на языке Java. Как и SpiderMonkey, Rhino соответствует ECMA-262 Edition 5.
