// Глава 1: Основы циклов в JavaScript

// Подглава 1.1: Что такое циклы

// Определение циклов
// Циклы - это конструкции в программировании, позволяющие выполнять один и тот же блок кода многократно.
// Они позволяют автоматизировать повторяющиеся задачи, обрабатывать массивы данных и многое другое.

// Зачем нужны циклы в программировании
// Циклы широко используются для обработки данных, перебора элементов массивов, выполнения итераций по коллекциям и многих других задач.
// Они сокращают повторяющийся код и делают программы более компактными и эффективными.
