// Подглава 1.3 Работа с файлами JavaScript

// Для работы с файлами JavaScript можно использовать различные подходы и технологии:

// 1. Встраивание скриптов в HTML: JavaScript часто используется в качестве встраиваемого языка для 
// придания интерактивности веб-страницам. Скрипты могут быть встроены непосредственно в HTML-код страницы 
// с помощью тега <script>.

// 2. Внешние файлы JavaScript: Для управления большими и сложными скриптами удобно использовать внешние файлы 
// JavaScript с расширением .js. Эти файлы загружаются браузером во время загрузки страницы.

// 3. Модули JavaScript: Современные версии JavaScript поддерживают модульную систему, которая позволяет 
// организовывать код в модули для повторного использования и управления зависимостями между компонентами 
// приложения.

// 4. Использование сред разработки: Для создания и редактирования файлов JavaScript удобно использовать 
// специализированные среды разработки, такие как Visual Studio Code, Sublime Text, Atom и другие, которые 
// обеспечивают удобный интерфейс и возможности для работы с кодом.

// 5. Сборщики и инструменты сборки: Для оптимизации и управления процессом разработки JavaScript-приложений 
// широко применяются сборщики и инструменты сборки, такие как Webpack, Parcel, Rollup и другие, которые 
// автоматизируют процесс сборки и минификации кода.
