// Глава 2: Циклы с предусловием
// Подглава 2.1: Цикл for

// Синтаксис цикла for
// Цикл for позволяет выполнить блок кода определенное количество раз.
// Синтаксис:
// for (начальное_значение; условие; шаг) {
//     блок кода
// }

// Использование переменных в цикле
// В цикле for обычно используются три переменные:
// - Начальное значение: задает начальное состояние цикла (часто это инициализация счетчика).
// - Условие: определяет, когда цикл должен завершиться.
// - Шаг: увеличение или уменьшение счетчика цикла.

// Примеры применения цикла for
// Пример 1: Вывод чисел от 1 до 5

// Первый вариант:
for (let i = 1; i <= 5; i++) {
    console.log(i);
}

// Пример 2: Вычисление суммы чисел от 1 до 10
let sum = 0;
for (let j = 1; j <= 10; j++) {
    sum += j;
}
console.log("Сумма чисел от 1 до 10:", sum);
