// Примитивные типы данных в JavaScript

// Примитивные типы данных представляют собой базовые типы данных в JavaScript, которые не являются объектами.

// 1. Число (Number)
let num = 10; // Целочисленный тип данных
let floatNum = 3.14; // Дробный тип данных

// 2. Строка (String)
let str = 'Hello'; // Строковый тип данных

// 3. Булевый (Boolean)
let bool = true; // Логический тип данных

// 4. Неопределенный (Undefined)
let undef; // Переменной присвоено значение undefined, если оно не было инициализировано

// 5. Нулевой (Null)
let n = null; // Значение переменной null используется для указания на отсутствие значения

// 6. Символ (Symbol) - добавлен в ECMAScript 6 (ES6)
let sym = Symbol('description'); // Создание уникального символа