// Подглава 3.2: Управление потоком выполнения

// Выполнение кода в зависимости от условий
// Управление потоком выполнения позволяет выбирать, какой код выполнять в зависимости от определенных условий.
// Для этого часто используются условные операторы, такие как if...else.

// Использование условий для управления циклами и функциями
// Условные операторы также могут использоваться для управления циклами и функциями.
// Например, цикл for может быть выполнен только при определенном условии.
// Также условия могут определять, вызывать ли функцию или нет.

// Создание динамических интерфейсов на основе условий
// Условные операторы часто используются при создании динамических интерфейсов.
// Например, при разработке веб-приложений можно изменять отображение элементов интерфейса в зависимости от действий пользователя или других условий.

// Пример:
const age = 20;

if (age >= 18) {
    console.log("Вы совершеннолетний");
} else {
    console.log("Вы несовершеннолетний");
}

// В этом примере код будет выполнен в зависимости от возраста, который задан в переменной age.
// Если возраст больше или равен 18, будет выведено сообщение о совершеннолетии, иначе будет выведено сообщение о несовершеннолетии.
