// Глава 1: Основы условных выражений в JavaScript

// Подглава 1.1: Введение в условные операторы
// Что такое условные операторы?
// Условные операторы - это инструменты в языке программирования, которые позволяют выполнять различные блоки кода в зависимости от выполнения определенных условий.

// Зачем нужны условные операторы в программировании?
// Условные операторы необходимы для создания ветвлений в программе, когда необходимо выполнить определенные действия в зависимости от того, выполняется ли определенное условие или нет.
