# Глава 2: Форматирование кода и PEP8

# Отступы в Python

# Форматирование кода - это процесс структурирования вашего кода таким образом, чтобы он был легко читаемым и понятным для других разработчиков.
# PEP8 - это стандарт кодирования на языке Python, который определяет правила форматирования кода для обеспечения единообразия и улучшения его читаемости.

# Отступы в Python
# Отступы в Python играют важную роль в структурировании кода. Они используются для обозначения блоков кода, таких как циклы, условные операторы и функции.
# Согласно PEP8, рекомендуется использовать отступ в виде 4 пробелов для каждого уровня вложенности.

# Зачем используются отступы в Python?
# Отступы обеспечивают четкую иерархию кода, делая его более понятным и легко читаемым.
# Они также помогают избежать ошибок вложенности, которые могут возникнуть при использовании других символов для обозначения блоков кода.

# Как использовать отступы в Python?
# Для создания отступов в Python используйте пробелы или табуляцию.
# Отступ должен состоять из 4 пробелов для каждого уровня вложенности, согласно стандарту PEP8.

# Несколько примеров

# Пример использования отступов в условном операторе
if True:
    print("Этот код находится внутри блока условия")
else:
    print("Этот код находится внутри блока else")

# Пример использования отступов в цикле
for i in range(5):
    print("Этот код находится внутри цикла")

# Пример использования отступов в функции
def my_function():
    print("Этот код находится внутри функции")

# Итог
# Правильное использование отступов в Python является важным аспектом написания чистого и понятного кода.
# Соблюдение стандарта PEP8 и использование 4 пробелов для отступов помогают улучшить читаемость вашего кода и делают его более структурированным.
