// Глава 16: Redux Advanced

// Redux DevTools предоставляет мощные возможности для отладки и мониторинга состояния приложения на основе Redux.
// Это расширение для браузера позволяет вам видеть все действия, которые происходят в вашем приложении, текущее состояние хранилища, 
// и откатывать или повторять действия для облегчения отладки.

// Redux DevTools является важным инструментом для разработчиков, работающих с Redux. 
// Он позволяет отслеживать состояние хранилища и действия, происходящие в приложении, 
// что облегчает процесс отладки и мониторинга.

// https://chromewebstore.google.com/detail/redux-devtools/lmhkpmbekcpmknklioeibfkpmmfibljd