// Подглава 9.1: Виды тестирования

// Модульное тестирование
/*
Модульное тестирование (unit testing) - это вид тестирования, при котором отдельные компоненты программы, такие как функции или классы, 
проверяются на корректность и соответствие требованиям. 
Модульные тесты обычно пишутся программистами для того, чтобы убедиться, что каждая часть программы работает правильно независимо от других частей.
*/

// Интеграционное тестирование
/*
Интеграционное тестирование (integration testing) - это вид тестирования, при котором проверяется взаимодействие между различными компонентами 
или модулями программы. 
Цель интеграционного тестирования - обнаружить ошибки взаимодействия между компонентами и убедиться, что они работают вместе корректно.
*/

// Системное тестирование
/*
Системное тестирование (system testing) - это вид тестирования, при котором проверяется работоспособность всей системы в целом, 
а не отдельных ее компонентов. 
Этот вид тестирования проводится для проверки соответствия системы требованиям и ожиданиям пользователя.
*/

// Примеры использования различных видов тестирования
/*
1. Модульное тестирование: Проверка отдельных функций или методов на корректность их работы, например, тестирование функции расчета суммы чисел.
2. Интеграционное тестирование: Проверка взаимодействия между модулями или компонентами программы, например, тестирование работы API веб-приложения.
3. Системное тестирование: Проверка работы всего приложения или системы в целом, например, тестирование работы интерфейса пользователя или функциональности приложения.
*/
